<?php
/*
 Template name: Шаблон страницы каталога
 Template post type: catalog
*/

    get_header();

?>	
<?php
	$language = 'rus';
	if (isset($_COOKIE["language"])) $language = $_COOKIE["language"];
?>
	<div id="catalog_page_template">
		<?php
			$catalog_banner = get_field('баннер');
			$catalog_title = get_field('первая_секция')['левая_колонка']['загловок'];
		?>
		<div id="catalog_header" class="d-flex align-items-center" style="background-image: url(<?=$catalog_banner['url'];?>)">
			<div class="container">
				<h1 class="wow fadeInLeft"><?=( $language == 'eng' ) ? get_field('название_на_английском') : get_the_title() ?> </h1>
				<div class="wow fadeInLeft" id="breadcrumbs"> <?php true_breadcrumbs(); ?> </div>
				<p class="mt-3 wow fadeInLeft" style="color: white;"><?=( $language == 'eng' ) ? 'All the presented goods do not contain gluten and are hypoallergenic' : 'Весь представленный товар не содержит глютен и гипоаллергенен' ?></p>
			</div>
		</div>
		<div id="fast_links" class="pt-4 pb-4">
			<div class="container">
				<div class="row ms-0 me-0">
					<div class="col-12 wow fadeInLeft"> <a class="btn bg-transparent" href="../"><?=( $language == 'eng' ) ? 'Back to catalog →' : 'Вернуться в каталог →' ?></a> </div>
				</div>
			</div>
		</div>
		<section id="catalog_second_section" class="bh mt-5">
			<div class="container">
				<div class="row ms-0 me-0">
					<div class="col-12 col-md-5 col-lg-4">
						<?php twenty_twenty_one_post_thumbnail(); ?>
					</div>
					<div class="col-12 col-md-7 col-lg-8">
						<div class="d-flex flex-row flex-wrap">
							<div class="page_title" style="min-width: 275px;"><h5><?=( $language == 'eng' ) ? get_field('название_на_английском') : get_the_title() ?></h5></div>
							<div class="page_social_link ms-md-4">
								<?php
									$social_link = get_field('социальная_сеть');
					                  if( $social_link ){
					                   	$render_size = '48 48';
				                      	if($social_link["иконка"] == "instagram") $render_size = "30 30";
				                      	if($social_link["иконка"] == "whatsapp") $render_size = "30 30";

				                      	( ($social_link['ссылка'] == '')||($social_link['ссылка'] == '#') ) ? $social_link['ссылка'] = 'https://wa.me/79603944123' : '';

				                       echo '<a style="color:'.$social_link['цвет_текста'].'" href="'.$social_link['ссылка'].'" class="social_link"><svg style="fill:'.$social_link['цвет_иконки'].'" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" width="30px" height="30px" viewBox="0 0 '.$render_size.'" enable-background="new 0 0 '.$render_size.'" xml:space="preserve">';
				                        if( $social_link['иконка'] == 'facebook' ){ ?>
				                            <path style="fill:<?=$social_link['цвет_иконки'];?>" d="M47.761,24c0,13.121-10.638,23.76-23.758,23.76C10.877,47.76,0.239,37.121,0.239,24c0-13.124,10.638-23.76,23.764-23.76 C37.123,0.24,47.761,10.876,47.761,24 M20.033,38.85H26.2V24.01h4.163l0.539-5.242H26.2v-3.083c0-1.156,0.769-1.427,1.308-1.427 h3.318V9.168L26.258,9.15c-5.072,0-6.225,3.796-6.225,6.224v3.394H17.1v5.242h2.933V38.85z"></path>
				                        <?php }
				                        elseif( $social_link['иконка'] == 'VK' ){ ?>
				                            <path style="fill:<?=$social_link['цвет_иконки'];?>" d="M47.761,24c0,13.121-10.639,23.76-23.76,23.76C10.878,47.76,0.239,37.121,0.239,24c0-13.123,10.639-23.76,23.762-23.76C37.122,0.24,47.761,10.877,47.761,24 M35.259,28.999c-2.621-2.433-2.271-2.041,0.89-6.25c1.923-2.562,2.696-4.126,2.45-4.796c-0.227-0.639-1.64-0.469-1.64-0.469l-4.71,0.029c0,0-0.351-0.048-0.609,0.106c-0.249,0.151-0.414,0.505-0.414,0.505s-0.742,1.982-1.734,3.669c-2.094,3.559-2.935,3.747-3.277,3.524c-0.796-0.516-0.597-2.068-0.597-3.171c0-3.449,0.522-4.887-1.02-5.259c-0.511-0.124-0.887-0.205-2.195-0.219c-1.678-0.016-3.101,0.007-3.904,0.398c-0.536,0.263-0.949,0.847-0.697,0.88c0.31,0.041,1.016,0.192,1.388,0.699c0.484,0.656,0.464,2.131,0.464,2.131s0.282,4.056-0.646,4.561c-0.632,0.347-1.503-0.36-3.37-3.588c-0.958-1.652-1.68-3.481-1.68-3.481s-0.14-0.344-0.392-0.527c-0.299-0.222-0.722-0.298-0.722-0.298l-4.469,0.018c0,0-0.674-0.003-0.919,0.289c-0.219,0.259-0.018,0.752-0.018,0.752s3.499,8.104,7.463,12.23c3.638,3.784,7.764,3.36,7.764,3.36h1.867c0,0,0.566,0.113,0.854-0.189c0.265-0.288,0.256-0.646,0.256-0.646s-0.034-2.512,1.129-2.883c1.15-0.36,2.624,2.429,4.188,3.497c1.182,0.812,2.079,0.633,2.079,0.633l4.181-0.056c0,0,2.186-0.136,1.149-1.858C38.281,32.451,37.763,31.321,35.259,28.999"></path>
				                        <?php }
				                        elseif( $social_link['иконка'] == 'instagram' ){ ?>
				                            <path style="fill:<?=$social_link['цвет_иконки'];?>" d="M15,11.014 C12.801,11.014 11.015,12.797 11.015,15 C11.015,17.202 12.802,18.987 15,18.987 C17.199,18.987 18.987,17.202 18.987,15 C18.987,12.797 17.199,11.014 15,11.014 L15,11.014 Z M15,17.606 C13.556,17.606 12.393,16.439 12.393,15 C12.393,13.561 13.556,12.394 15,12.394 C16.429,12.394 17.607,13.561 17.607,15 C17.607,16.439 16.444,17.606 15,17.606 L15,17.606 Z"></path><path style="fill:<?=$social_link['цвет_фона'];?>" d="M19.385,9.556 C18.872,9.556 18.465,9.964 18.465,10.477 C18.465,10.989 18.872,11.396 19.385,11.396 C19.898,11.396 20.306,10.989 20.306,10.477 C20.306,9.964 19.897,9.556 19.385,9.556 L19.385,9.556 Z"></path><path style="fill:<?=$social_link['цвет_фона'];?>" d="M15.002,0.15 C6.798,0.15 0.149,6.797 0.149,15 C0.149,23.201 6.798,29.85 15.002,29.85 C23.201,29.85 29.852,23.202 29.852,15 C29.852,6.797 23.201,0.15 15.002,0.15 L15.002,0.15 Z M22.666,18.265 C22.666,20.688 20.687,22.666 18.25,22.666 L11.75,22.666 C9.312,22.666 7.333,20.687 7.333,18.28 L7.333,11.734 C7.333,9.312 9.311,7.334 11.75,7.334 L18.25,7.334 C20.688,7.334 22.666,9.312 22.666,11.734 L22.666,18.265 L22.666,18.265 Z"></path>
				                        <?php }
				                        elseif( $social_link['иконка'] == 'whatsapp' ){ ?>
				                        	<path style="fill:<?=$social_link['цвет_иконки'];?>" d="M 24.964844 5.011719 C 22.332031 2.378906 18.828125 0.925781 15.097656 0.921875 C 7.414062 0.921875 1.15625 7.179688 1.152344 14.867188 C 1.152344 17.324219 1.796875 19.722656 3.015625 21.839844 L 1.035156 29.066406 L 8.429688 27.125 C 10.464844 28.238281 12.757812 28.824219 15.09375 28.824219 L 15.097656 28.824219 C 22.785156 28.824219 29.039062 22.566406 29.042969 14.878906 C 29.046875 11.152344 27.597656 7.648438 24.964844 5.011719 Z M 15.097656 26.46875 L 15.09375 26.46875 C 13.015625 26.46875 10.976562 25.910156 9.195312 24.851562 L 8.773438 24.601562 L 4.386719 25.75 L 5.554688 21.476562 L 5.28125 21.035156 C 4.121094 19.191406 3.507812 17.058594 3.507812 14.867188 C 3.511719 8.476562 8.710938 3.277344 15.105469 3.277344 C 18.199219 3.28125 21.109375 4.488281 23.296875 6.675781 C 25.484375 8.867188 26.691406 11.78125 26.691406 14.878906 C 26.6875 21.269531 21.488281 26.46875 15.097656 26.46875 Z M 21.457031 17.789062 C 21.109375 17.613281 19.394531 16.769531 19.074219 16.652344 C 18.757812 16.539062 18.523438 16.480469 18.292969 16.828125 C 18.058594 17.175781 17.390625 17.960938 17.1875 18.195312 C 16.984375 18.425781 16.78125 18.457031 16.433594 18.28125 C 16.085938 18.105469 14.960938 17.738281 13.632812 16.550781 C 12.597656 15.628906 11.894531 14.488281 11.691406 14.136719 C 11.488281 13.789062 11.691406 13.617188 11.847656 13.425781 C 12.222656 12.957031 12.601562 12.46875 12.71875 12.234375 C 12.832031 12.003906 12.773438 11.800781 12.6875 11.625 C 12.601562 11.449219 11.902344 9.734375 11.613281 9.039062 C 11.332031 8.359375 11.042969 8.449219 10.828125 8.441406 C 10.625 8.429688 10.394531 8.425781 10.160156 8.425781 C 9.929688 8.425781 9.550781 8.515625 9.234375 8.863281 C 8.914062 9.210938 8.011719 10.054688 8.011719 11.769531 C 8.011719 13.484375 9.261719 15.140625 9.4375 15.375 C 9.609375 15.605469 11.894531 19.125 15.386719 20.636719 C 16.21875 20.996094 16.867188 21.210938 17.375 21.371094 C 18.210938 21.636719 18.96875 21.597656 19.570312 21.507812 C 20.238281 21.40625 21.628906 20.664062 21.921875 19.851562 C 22.210938 19.039062 22.210938 18.339844 22.125 18.195312 C 22.039062 18.050781 21.804688 17.960938 21.457031 17.789062 Z M 21.457031 17.789062 "/>
				                        <?php }
				                        elseif( $social_link['иконка'] == 'email' ){ ?>
				                            <path style="fill:<?=$social_link['цвет_иконки'];?>" d="M0 4a2 2 0 0 1 2-2h12a2 2 0 0 1 2 2v8a2 2 0 0 1-2 2H2a2 2 0 0 1-2-2V4zm2-1a1 1 0 0 0-1 1v.217l7 4.2 7-4.2V4a1 1 0 0 0-1-1H2zm13 2.383-4.758 2.855L15 11.114v-5.73zm-.034 6.878L9.271 8.82 8 9.583 6.728 8.82l-5.694 3.44A1 1 0 0 0 2 13h12a1 1 0 0 0 .966-.739zM1 11.114l4.758-2.876L1 5.383v5.73z"/>
				                        <?php }

				                        if( $language == 'eng' ) echo '</svg><span class="ms-3">'.$social_link['текст_на_кнопке_на_английском'].'</span></a>';
				                        else echo '</svg><span class="ms-3">'.$social_link['текст_на_кнопке'].'</span></a>';
					                  }
				                ?>
							</div>
						</div>
						<div id="badge" class="col-12 mt-3 mb-3">
							<?php 
			    				if( get_field('наличие') == 'В наличии' ){ ?>
			    					<div class="catalog_page_badge green"><?=( $language == 'eng' ) ? "In stock" : "В наличии"?></div>
			    			<?php }?>
			    			<?php 
			    				if( get_field('наличие') == 'Нет в наличии' ){ ?>
			    					<div class="catalog_page_badge red"><?=( $language == 'eng' ) ? "Out of stock" : "Нет в наличии"?></div>
			    			<?php }?>
						</div>
						<div id="price">
							<?php
								$product_discount = get_field('скидка');
								if( ($product_discount['выводить_скидку'] == 1)&&(get_field('цена') != '') ){ ?>
									<div id="prev_price" style="color: red; text-decoration: line-through;">
										<p style="color:black;"><?=( $language == 'eng' ) ? "Price" : "Цена:"?><span class="mt-2"><?=(int)get_field('цена')*(float)$product_discount['коэфициент'];?></span> ₽</p>										
									</div>
								<?php
									}
								?>							
							<div id="current_price" style="font-size: 30px;">
								<?php
								 	if( is_numeric(get_field('цена')) ){ ?>
								 		<?=( $language == 'eng' ) ? "Price:" : "Цена:"?><span class="mt-2"><?=get_field('цена');?></span> ₽
								 	<?php
								 	}
								 	else{ ?>
								 		<span class="mt-2"><?=get_field('цена');?></span>
								 	<?php
								 	}
								?>								
							</div>							
						</div>
						<div id="catalog_page_content" class="mt-4">
							<?=( $language == 'eng' ) ? get_field('описание_на_английском') : get_the_content()?>
						</div>
						<div id="under_content_section" class="d-flex flex-column flex-sm-row ms-0 me-0 mt-4 ">
							<div>
								<a href="#" class="btn bg-transparent" type="button" data-bs-toggle="modal" data-bs-target="#request_modal"><?=( $language == 'eng' ) ? 'Request a price list' : 'Запросить прайс-лист'?></a>
							</div>
							<div class="mt-3 ms-sm-4 mt-sm-0">
								<a href="#" class="btn bg-reverse" type="button" data-bs-toggle="modal" data-bs-target="#request_modal"><?=( $language == 'eng' ) ? 'leave a request' : 'Оставить заявку'?></a>
							</div>							
						</div>
					</div>	
				</div>
			</div>
		</section>
	</div>

<?php
    get_footer();
?>